In [25]:
import pandas as pd


data = {'year': [2000, 2001,2002,2003,2004],
       'first_place':['john','boo','foo','doo','cheese'],
       'second_place':['boo','doo', 'poo','banana','chair'],
       'third_place':['apple','orange','cheese','milk','pear']}
df = pd.DataFrame(data)
df

   year first_place second_place third_place
0  2000        john          boo       apple
1  2001         boo          doo      orange
2  2002         foo          poo      cheese
3  2003         doo       banana        milk
4  2004      cheese        chair        pear

In [26]:
names = df.first_place.append(df.second_place).append(df.third_place)
names = names.unique()

C:\Users\ykxio\AppData\Local\Temp\ipykernel_18132\918800806.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  names = df.first_place.append(df.second_place).append(df.third_place)

In [27]:
names

array(['john', 'boo', 'foo', 'doo', 'cheese', 'poo', 'banana', 'chair',
       'apple', 'orange', 'milk', 'pear'], dtype=object)

In [28]:
df_new = pd.DataFrame()

n1 = df['first_place'].value_counts().to_frame()

n2= df['second_place'].value_counts().to_frame()

n3= df['third_place'].value_counts().to_frame()
df = pd.concat([n1,n2,n3], axis = 1)
df

        first_place  second_place  third_place
john            1.0           NaN          NaN
boo             1.0           1.0          NaN
foo             1.0           NaN          NaN
doo             1.0           1.0          NaN
cheese          1.0           NaN          1.0
poo             NaN           1.0          NaN
banana          NaN           1.0          NaN
chair           NaN           1.0          NaN
apple           NaN           NaN          1.0
orange          NaN           NaN          1.0
milk            NaN           NaN          1.0
pear            NaN           NaN          1.0

In [30]:
df.fillna(0)

        first_place  second_place  third_place
john            1.0           0.0          0.0
boo             1.0           1.0          0.0
foo             1.0           0.0          0.0
doo             1.0           1.0          0.0
cheese          1.0           0.0          1.0
poo             0.0           1.0          0.0
banana          0.0           1.0          0.0
chair           0.0           1.0          0.0
apple           0.0           0.0          1.0
orange          0.0           0.0          1.0
milk            0.0           0.0          1.0
pear            0.0           0.0          1.0